Tsegay844/edge-ai-vineyard-monitoring/esp-detection/esp-detection/deployment/grape_leaf_detect_camera/esp-dl/examples/grape_leaf_detect/sdkconfig.defaults.esp32s3
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=40
CONFIG_FATFS_LFN_HEAP=y
CONFIG_BSP_SD_FORMAT_ON_MOUNT_FAIL=y

# Model Configuration - Back to FLASH_RODATA (224x224 working method)
CONFIG_ESPDET_DETECT_MODEL_IN_SDCARD=n
CONFIG_ESPDET_DETECT_MODEL_IN_FLASH_RODATA=y
CONFIG_ESPDET_DETECT_MODEL_IN_FLASH_PARTITION=n
CONFIG_ESPDET_DETECT_MODEL_LOCATION=0

# Cache configuration
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
